<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
      <key>Description</key>
      <string>Downloads the latest Omnissa Horizon Client disk image, extracts the installer package and prepares it for deployment.</string>
      <key>Identifier</key>
      <string>com.github.rtrouton.pkg.OmnissaHorizonClient</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>Omnissa Horizon Client</string>
         <key>APPNAME</key>
         <string>Omnissa Horizon Client</string>
         <key>VENDOR</key>
         <string>Omnissa</string>
         <key>SOFTWARETITLE1</key>
         <string>Horizon</string>
         <key>SOFTWARETITLE2</key>
         <string>Client</string>
      </dict>
      <key>MinimumVersion</key>
      <string>1.0.0</string>
      <key>ParentRecipe</key>
      <string>com.github.rtrouton.pkg.OmnissaHorizonClient</string>
      <key>Process</key>
      <array>
        <dict>
            <key>Arguments</key>
            <dict>
               <key>flat_pkg_path</key>
               <string>%pathname%/Omnissa Horizon Client.pkg</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
         </dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>pkg_payload_path</key>
               <string>%RECIPE_CACHE_DIR%/unpack/Omnissa.Horizon.Client.pkg/Payload</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
         </dict>
         <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
               <key>input_plist_path</key>
               <string>%RECIPE_CACHE_DIR%/payload/%APPNAME%.app/Contents/Info.plist</string>
               <key>plist_version_key</key>
               <string>CFBundleShortVersionString</string>
            </dict>
         </dict>
        <dict>
          <key>Arguments</key>
          <dict>
            <key>info_path</key>
            <string>%RECIPE_CACHE_DIR%/payload/%APPNAME%.app/Contents/Info.plist</string>
            <key>plist_keys</key>
            <dict>
              <key>CFBundleIdentifier</key>
              <string>bundleid</string>
            </dict>
          </dict>
          <key>Processor</key>
          <string>PlistReader</string>
        </dict>
    		<dict>
    			<key>Arguments</key>
    			<dict>
    				<key>app_file</key>
    				<string>%destination_path%/%NAME%.app</string>
    				<key>name</key>
    				<string>%NAME%</string>
    			</dict>
    			<key>Processor</key>
    			<string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
    		</dict>
         <dict>
            <key>Arguments</key>
            <dict>
               <key>path_list</key>
               <array>
                  <string>%RECIPE_CACHE_DIR%/payload</string>
                  <string>%RECIPE_CACHE_DIR%/unpack</string>
               </array>
            </dict>
            <key>Processor</key>
            <string>PathDeleter</string>
         </dict>
        <dict>
          <key>Arguments</key>
          <dict>
            <key>app_file</key>
            <string>%pathname%</string>
            <key>bundleId</key>
            <string>%bundleid%</string>
            <key>bundleVersion</key>
            <string>%version%</string>
            <key>description</key>
            <string>%description%</string>
            <key>displayname</key>
            <string>%display_name%</string>
            <key>icon</key>
            <string>%icon_file_path%</string>
            <key>publisher</key>
            <string>%developer%</string>
            <key>version</key>
            <string>%version%</string>
          </dict>
          <key>Processor</key>
          <string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
        </dict>
      </array>
  </dict>
</plist>
